app/controllers/archives_controller.rb

  def index
    @archives=Archive.all.order('name ASC')
---
SELECT "archives".* FROM "archives" ORDER BY name ASC

  def create
    @items=Item.all.order('name ASC')
---
SELECT "items".* FROM "items" ORDER BY name ASC

  def write_params
    i=0
    error=0
    @items.each do |item|
      if params[:price][i]!=''
        @archive=Archive.new
        @archive[:name]=item.name
        @archive[:price]=params[:price][i]
        @archive[:brand]=params[:brand][i]
        @archive[:purchase_date]=params[:purchase_date]
        @archive[:place]=params[:place]
        if(params[:image].blank? || params[:image][item.name].blank?)
          image_url='https://res.cloudinary.com/tsofit/image/upload/v1587029587/samples/new/no-image_czq7kx.jpg'
          @archive[:image]=image_url
        else
          image_url=upload_image(params[:image][item.name])
          @archive[:image]=image_url
        end
        if @archive.save
          item.destroy
---
INSERT INTO "archives" ("name", "brand", "image", "price", "place", "purchase_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "archives" WHERE "archives"."id" = ?  [["id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 145]]

  def purchase
    @items=Item.all.order('name ASC')
---
SELECT "items".* FROM "items" ORDER BY name ASC

  def destroy
    @archive=Archive.find(params[:id])
    @archive.destroy
---
SELECT "archives".* FROM "archives" WHERE "archives"."id" = ? LIMIT ?  [["id", 82], ["LIMIT", 1]]
DELETE FROM "archives" WHERE "archives"."id" = ?  [["id", 82]]