app/controllers/items_controller.rb

  def index
    @items=Item.all.order('name ASC')
---
SELECT "items".* FROM "items" ORDER BY Item.name DESC

  def create
    #render plain: params.inspect
    @item=Item.new(item_params) #instance variable to hold a refernce to the article object
    if @item.save  #saving the model in the database
      redirect_to items_path
    else
      @items=Item.all.order('name ASC')
---
INSERT INTO "items" ("name", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "h2"], ["details", ""], ["created_at", "2020-04-15 18:19:08.521892"], ["updated_at", "2020-04-15 18:19:08.521892"]]
SELECT "items".* FROM "items" ORDER BY name ASC

  def update
    #render plain: params.inspect
    @item=Item.find(params[:id])
    if @item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 140], ["LIMIT", 1]]
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "applefdtre"], ["updated_at", "2020-04-16 07:22:31.394851"], ["id", 140]]